In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Bài 1:

In [5]:
def show_stars(n):
    str=""
    for i in range(1,n+1):
        str+="*"
        print(str)

In [6]:
show_stars(2)

*
**

In [8]:
show_stars(5)

*
**
***
****
*****

### Bài 2

### Bài 3

In [11]:
%config Completer.use_jedi = False

In [142]:
df1=pd.read_csv(r'C:\Users\Laptop EDG\Downloads\Names\Names\yob1880.txt', header=None).head(5)
df1

           0  1     2
0       Mary  F  7065
1       Anna  F  2604
2       Emma  F  2003
3  Elizabeth  F  1939
4     Minnie  F  1746

In [146]:
def process_data():
    alldata=pd.DataFrame(columns=['Name','Sex','Id','Year'])
    for year in range(1880,2019):
        url='C:/Users/Laptop EDG/Downloads/Names/Names/yob'+str(year)+'.txt'
        df=pd.read_csv(url, header=None)
        df.columns=['Name','Sex','Id']
        df['Year']=year
        alldata=pd.concat([alldata,df],ignore_index=True)
    return alldata

In [147]:
data=process_data()
data

              Name Sex    Id  Year
0             Mary   F  7065  1880
1             Anna   F  2604  1880
2             Emma   F  2003  1880
3        Elizabeth   F  1939  1880
4           Minnie   F  1746  1880
...            ...  ..   ...   ...
1957041      Zylas   M     5  2018
1957042      Zyran   M     5  2018
1957043      Zyrie   M     5  2018
1957044      Zyron   M     5  2018
1957045      Zzyzx   M     5  2018

[1957046 rows x 4 columns]